bsdimp/2.11bsd/man/man1/vmstat.1
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)vmstat.1	6.3 (Berkeley) 3/15/86
.\"
.TH VMSTAT 1 "December 30, 2006"
.UC 4
.de s1
.if n .sp
.if t .sp .1i
..
.de t1
.if n .ta 5n
.if t .ta 1i
..
.SH NAME
vmstat \- report virtual memory statistics (2.11BSD)
.SH SYNOPSIS
.B vmstat
[
.B \-fsip
]
[ drives ]
[ interval [ count ] ]
.SH DESCRIPTION
.I Vmstat
delves into the system and normally reports certain statistics kept about
process, virtual memory, disk, trap and cpu activity.
If given a
.B \-f
argument, it instead reports on the number of
.I forks
and
.I vforks
since system startup and the number of pages of virtual memory involved in each
kind of fork.
If given a
.B \-s
argument, it instead prints the contents
of the
.I sum
structure, giving the total number of several kinds of paging related
events which have occurred since boot.
If given a
.B \-i
argument, it instead reports on the number of
.I interrupts
taken by each device since system startup.
.PP
If none of these options are given,
.I vmstat
will report in the first line a summary of the virtual memory activity 
since the system has been booted.
If given a
.B \-p
argument, a different set of information is shown with additional pdp11
specific fields.
If
.I interval
is specified, then successive lines are summaries over the last
.I interval
seconds.
``vmstat 5'' will print what the system is doing every five seconds;
this is a good choice of printing interval since this is how often
some of the statistics are sampled in the system; others vary every
second, running the output for a while will make it apparent which
are recomputed every second.
If a
.I count
is given, the statistics are repeated
.I count
times.
The format fields are:
.PP
Procs: information about numbers of processes in various states.
.s1
.t1
.nf
r	in run queue
b	blocked for resources (i/o, paging, etc.)
w	runnable or short sleeper (< 20 secs) but swapped
.fi
.s1
Memory: information about the usage of virtual and real memory.
Virtual pages are considered active if they belong to processes which
are running or have run in the last 20 seconds.
A ``page'' here is a disk block of 1024 bytes.
.s1
.t1
.nf
avm	active virtual memory
tx	fraction of active virtual memory used by text  (\-p only)
fre	size of the free list
.fi
.s1
Page: information about text table and swaping activity.
These are averaged each five seconds, and given in units per second.
.s1
.t1
.nf
ti	text table entries found in use/sticky
tc	text table entries found in cache
pi	pages swapped in
po	pages swapped out
fr	text table entries freed
fc	text table entries placed in cache
ov	user mode overlay changes
.fi
.s1
Swap: information about swaping activity (\-p only)
.sl
.tl
.nf
i	process swap in rate
o	process swap out rate
.fi
.sl
Disks: Disk I/O rates in kbytes/sec.
The number under each of these is the unit number.
.s1
System: various rate averages per second over last 5 seconds.
.s1
.t1
.nf
pd	pseudo-dma interrupts (\-p only)
in	(non clock) device interrupts per second
sy	system calls per second
tr	traps/faults per second (\-p only)
ov	user mode overlay changes (\-p only)
cs	cpu context switch rate (switches/sec)
.fi
.s1
Cpu: breakdown of percentage usage of CPU time
.s1
.nf
us	user time for normal processes (includes nice time if no \-p)
ni	user time for low priority processes (\-p only)
sy	system time
id	cpu idle
.fi
.PP
If more than 4 disk drives are configured in the system,
.I vmstat
displays only the first 4 drives, with priority given
to Massbus disk drives (i.e. if both Unibus and Massbus
drives are present and the total number of drives exceeds
4, then some number of Unibus drives will not be displayed
in favor of the Massbus drives).  To force
.I vmstat
to display specific drives, their names may be supplied on
the command line.
.SH FILES
/dev/kmem, /vmunix
.SH SEE ALSO
.IR systat (1),
.IR iostat (1)
.PP
The sections starting with ``Interpreting system activity'' in
.IR "Installing and Operating 4.2bsd" .
